<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ApartmentSeeder extends Seeder
{
    public function run(): void
    {
        DB::statement('DELETE FROM apartments');
        DB::table('apartments')->insert([
        [
            'name'  => 'Green View Apartment',
            'rent'  => 15000.00,
            'image' => 'https://picsum.photos/400/300?random=1',
            'status' => false,
            'descriptions' => 'এই সুন্দর ও আরামদায়ক অ্যাপার্টমেন্টটি আধুনিক জীবনযাপনের জন্য উপযুক্তভাবে ডিজাইন করা হয়েছে। প্রশস্ত বেডরুম, পর্যাপ্ত আলো-বাতাস এবং মনোরম পরিবেশ আপনাকে দেবে স্বাচ্ছন্দ্যের এক নতুন অভিজ্ঞতা। রান্নাঘরটি আধুনিক ফিটিংসসহ সজ্জিত এবং বাথরুমে রয়েছে উন্নত মানের স্যানিটারি ব্যবস্থা।

            নিরাপত্তা ব্যবস্থার পাশাপাশি রয়েছে নিরবচ্ছিন্ন পানি ও বিদ্যুৎ সুবিধা। আশপাশে স্কুল, কলেজ, হাসপাতাল ও বাজার থাকায় দৈনন্দিন জীবন হবে আরও সহজ ও সুবিধাজনক। পরিবার বা চাকরিজীবীদের জন্য এটি একটি আদর্শ বাসস্থান।'
        ],
        [
            'name'  => 'Sky Line Residency',
            'rent'  => 22000.00,
            'image' => 'https://picsum.photos/400/300?random=2',
            'status' => false,
            'descriptions' => 'এই সুন্দর ও আরামদায়ক অ্যাপার্টমেন্টটি আধুনিক জীবনযাপনের জন্য উপযুক্তভাবে ডিজাইন করা হয়েছে। প্রশস্ত বেডরুম, পর্যাপ্ত আলো-বাতাস এবং মনোরম পরিবেশ আপনাকে দেবে স্বাচ্ছন্দ্যের এক নতুন অভিজ্ঞতা। রান্নাঘরটি আধুনিক ফিটিংসসহ সজ্জিত এবং বাথরুমে রয়েছে উন্নত মানের স্যানিটারি ব্যবস্থা।

            নিরাপত্তা ব্যবস্থার পাশাপাশি রয়েছে নিরবচ্ছিন্ন পানি ও বিদ্যুৎ সুবিধা। আশপাশে স্কুল, কলেজ, হাসপাতাল ও বাজার থাকায় দৈনন্দিন জীবন হবে আরও সহজ ও সুবিধাজনক। পরিবার বা চাকরিজীবীদের জন্য এটি একটি আদর্শ বাসস্থান।'
        ],
        [
            'name'  => 'City Heights',
            'rent'  => 18000.00,
            'image' => 'https://picsum.photos/400/300?random=3',
            'status' => false,
            'descriptions' => 'এই সুন্দর ও আরামদায়ক অ্যাপার্টমেন্টটি আধুনিক জীবনযাপনের জন্য উপযুক্তভাবে ডিজাইন করা হয়েছে। প্রশস্ত বেডরুম, পর্যাপ্ত আলো-বাতাস এবং মনোরম পরিবেশ আপনাকে দেবে স্বাচ্ছন্দ্যের এক নতুন অভিজ্ঞতা। রান্নাঘরটি আধুনিক ফিটিংসসহ সজ্জিত এবং বাথরুমে রয়েছে উন্নত মানের স্যানিটারি ব্যবস্থা।

            নিরাপত্তা ব্যবস্থার পাশাপাশি রয়েছে নিরবচ্ছিন্ন পানি ও বিদ্যুৎ সুবিধা। আশপাশে স্কুল, কলেজ, হাসপাতাল ও বাজার থাকায় দৈনন্দিন জীবন হবে আরও সহজ ও সুবিধাজনক। পরিবার বা চাকরিজীবীদের জন্য এটি একটি আদর্শ বাসস্থান।'
        ],
    ]);

    }
}
